{"pageProps":{"vision":{"line":"Amplifying Strength in Our Voices as One EDGE2021 ","desc":"An EDGE2021 CED that sees strength in our voices. Empowering aspiring students to take a stand as individuals and as one. Taking a stand as one batch, for the people. Furthermore, to create a unified batch, we should hone each other to our greatest potential through our voices, this will commence  our journey to progress as one CED."},"candidates":{"bp":{"fName":"Anne","lName":"Sy","position":"Batch President","img":"https://via.placeholder.com/400x600","creds":["Licensed First Aider, Amity Youth Volunteer Organization","Public Affairs Department Head, The Sophrpsyne Movement","Externals Department Core, The Graciella Collective","Committee Head, Bukas Loob Sa Diyos - Youth Encounter","Best Speaker, St. Scholastica’s Academy - Bacolod Debate Club"]},"vp":{"fName":"Tsarina","lName":"Olis","position":"Batch Vice President","img":"https://via.placeholder.com/400x600","creds":["Former Vice President, Our Lady of Perpetual Succor College","Former Member, Saldang Youth Organization","Former Member, MCHS First Aid Club"]},"bl":{"fName":"Achilles","lName":"Amores","position":"Batch Legislator","img":"https://via.placeholder.com/400x600","creds":["Volunteer Teacher, Tulong Aral Sa Kapatid","Former OJT Trainee, National Parks Development Committee (Rizal Park)","Member, Gawad Kalinga"]}},"college":"bagced","spoa":[{"title":"This Is What We CED","desc":"This Is What We CED is a year-long project that centers around the batch’s advocacies and passions. This podcast series will provide the students with the opportunity to have open and comprehensive discussions regarding the assigned topic with the esteemed speakers. The podcasts will be uploaded monthly and each month will have its own designated topic."},{"title":"TransformED","desc":"TransformED is a wellness workshop that aims to promote holistic and personal development through prioritizing the student’s overall well-being. This project will tackle various components that will help them ease stress while reinventing themselves in the process. Each month will have its very own specific skill or topics on how to improve one's self, providing support to one another, and students are given the opportunity to showcase their talents."},{"title":"Ready, CED, Go!","desc":"Ready, CED, Go! is a project that serves as a call to action ID 121 CED volunteers in being proactive through contributing in many ways to the fellow citizens of country during trying times. Through Ready, CED, Go!, students are able to explore their hearts for service through donation drives, relief operations, and other initiatives together with the batch unit."},{"title":"NavigatED","desc":"NavigatED is a project that aims to make student life easier and accessible through a Student Services Content Kit that includes a step by step guide regarding all the student services processes and needs. Alongside this will be a two-part webinar that will tackle as well as explain in detail on the various processes as well as  how to navigate through the kit."},{"title":"SupportED","desc":"SupportED is a year-long batch program wherein students of CED are given the time to communicate with each other. This aims to serve as a safety net’ of the students, where they can raise concerns regarding academic or personal matters. This project will be an avenue for personal growth, creating productive and meaning connection in pursuit to strengthen and unify the batch."},{"title":"BondED","desc":"Given the online setting, it is quite challenging to build a genuine connection within our batch. In order to combat this barrier, BondED aims to strengthen the unity amongst the batch through termly bonding sessions. Each bonding session will have a different theme and program . This will be executed through recreational activities through game night, movie night, and recreational activities that will include awards that shall be given by the batch unit at the end of the night."}]},"__N_SSG":true}