{"pageProps":{"vision":{"line":"Strengthening Our Community towards an Empowered FAST2021","desc":"As a college that develops changemakers for humanity and society, CLA is a community built by diverse individuals with equally diverse paths. With all the opportunities and various courses within the college, a CLA student can be anything they desire to be in the future. We can use this as an opportunity to achieve a strong community built by a supportive and unified FAST2021 that uplifts each other despite differences. This ensures an inclusive environment that maximizes everyone's potential to be empowered and have access to avenues for collective and holistic growth as we start our college journey."},"candidates":{"bp":{"fName":"Kyzer","lName":"Campos","position":"Batch President","img":"https://via.placeholder.com/400x600","creds":["Best Position Paper in the Disarment and International Security Committee (DISEC), Delegate of Cambodia, Asia Youth International Model United Nations (AYIMUN)","Executive for Student Welfare of ACG","Executive for Mental Health Program of USG OVPIA","Executive for OTREAS Publicity & Promotions of USG OSEC"]},"vp":{"fName":"Sab","lName":"Del Rosario","position":"Batch Vice President","img":"https://via.placeholder.com/400x600","creds":["Variety Show Arts Head, Student Council of Poveda","Camp Counselor Rookie of the Year, California Summer Camps","Junior Officer, Habitat for Humanity Green Chapter","3-year Arts Committee Member, Student Council of Poveda"]},"bl":{"fName":"Janella","lName":"Lim","position":"Batch Legislator","img":"https://via.placeholder.com/400x600","creds":["Top 10 Finalist of TCS Sustainathlon Philippines 2021, Edukasyon.ph","“Repurposing Medical Waste”, Environmental Sustainability Winning Group, Habitat for Humanity Green Chapter’s Builders’ Summit 2021","Executive for Student Welfare, ACG ","Executive for Student Rights & Welfare, USG OVPIA"]}},"college":"cla","spoa":[{"title":"FAST ASSIST","desc":"As frosh trying to navigate a completely new environment in an online setting, it can be challenging to talk about everyday concerns. FAST ASSIST (A Safe Space Involving STudents) aims to provide a safe avenue through virtual sessions for the ID 121 students to share student life questions, experiences, and suggestions to improve the online learning environment and for a more inclusive community. With this, we will be able to create a stronger support system that can create collective change by amplifying each other’s voices for a better college experience."},{"title":"All in ONE21","desc":"ALL-IN-ONE21 is a personalized student services platform that ensures that all student processes and information is made accessible and understandable through three initiatives: (1) a subscription-based newsletter where students may receive timely announcements relating to student life through their preferred mode of communication, (2) an automated chatbot that will allow students to receive quick and relevant answers to any of their concerns, and (3) a consolidated database that will serve as a freshman guide for our batch by outlining all relevant processes, personnel, projects, groups, and more."},{"title":"CLA Blockbuster","desc":"With CLA Blockbuster, our batch will be able to explore new skills, hone our capabilities, and build our collective identity. This project will hold meaningful collaborations and easy-to-follow themed monthly workshops that cater to specific talents and skills such as software basics, art, music, writing and more. We can celebrate our individuality and diversity within each student sector and showcase these in exhibitions and get-to-know videos that go hand-in-hand with each month’s theme. "},{"title":"CLArify","desc":"“CLArify” is a 3-week series that aims to let CLA ID 121 learn more about their respective programs and what opportunities lie ahead of them through interactive talks with their seniors and graduates. Consolidated survival kits with essential tips and other information from the talks will also be distributed through QR badges for us to easily access them anytime, anywhere. Through this, each student would be well equipped and informed of what lies ahead in their own college journeys and career paths."},{"title":"Your Choice, Your Voice","desc":"As Halalan 2022 draws near, being updated on the elections and national affairs are necessary for us as first-time voters. “Your Choice, Your Voice” is a 2-part project in hopeful partnership with BLSP through OVPEA dedicated to guide ID121 on voting processes and nation-building . “Your Choice” focuses on political viewpoints, candidates’ profiles, and voting procedures for well-informed decisions for the betterment of our country. “Your Voice” tackles national affairs from multiple perspectives with both professionals in different fields and our fellow batchmates."},{"title":"AdvocaZINE","desc":"AdvocaZINE aims to empower our batch by giving students an avenue to express their creativity through creating advocacy-based art such as drawings, poems, and more. This monthly booklet will feature the Sustainable Development Goals and other relevant topics, works and narratives from fellow batchmates, and testimonials from professionals and advocacy-based organizations that may help us further actualize our personal advocacies through the projects and platforms that will be provided."}]},"__N_SSG":true}