{"pageProps":{"vision":{"line":"Advancing Holistic Student Welfare for a Transformative FOCUS2021","desc":"We journey as frosh with a vision to become adaptive Lasallian scientists. In doing so, we continuously conquer present-time conditions and strive to be limitless in making a difference in various fields of interest. Thus, together, we envision the advancement of holistic student welfare while utilizing sustainable dynamic involvement of the students as a foundation in achieving excellence, all for a transformative FOCUS2021."},"candidates":{"bp":{"fName":"Andrea","lName":"Roque","position":"Batch President","img":"https://via.placeholder.com/400x600","creds":["Volunteer, National Secretariat, Team Leni Robredo","Former Regional Coordinator, Team Leni Robredo","Former Batch Representative, Supreme Student Council, Dominican College","Former Literary Writer, Achievers, Dominican College"]},"vp":{"fName":"Kakay","lName":"Del Rosario","position":"Batch Vice President","img":"https://via.placeholder.com/400x600","creds":["Executive for Academics, Office of the VP for Internal Affairs, DLSU USG","Executive for Documentation & Logistics, Office of the Executive Treasurer, DLSU USG","Former Batch Representative, Student Council, St. James Academy","Executive for Research & Development, Office of the Executive Vice President, Santugon sa Tawag ng Panahon","Associate for Research & Development, UNITE 2030 PH","Associate for Project Management, Tungkod PH","Project Head for Pahiram Equipment Initiative, Office of the VP for Internal Affairs, DLSU USG","Academic Excellence Awardee, Univerisity of Santo Tomas","Albertus Magnus Awardee, University of Santo Tomas"]},"bl":{"fName":"Jeanne","lName":"Cabansag","position":"Batch Legislator","img":"https://via.placeholder.com/400x600","creds":["Executive for Marketing, DLSU Science College Government","Former President, Supreme Student Government, St. Louis School of Solano, Inc","Former Young Provincial Vice Governor, Young Provincial Officials 2020","Representative, Provincial Local Youth Development Council","Former President, St. Louis School-Zonta Club, St. Louis School of Solano, Inc.","Gerry Roxas Leadership Awardee","Supreme Student Government Leadership Excellence","Louisian Leadership Awardee","Top 3, Ten Outstanding Sons and Daughters of OFWs Student Achievers (TOSDOSA) Awards"]}},"college":"cos","spoa":[{"title":"COS Express","desc":"The overall umbrella project that will provide Student Services to our batch, with forms of assistance such as a Telegram, Discord, and Google Workspace channel that shows all the necessary DLSU updates and announcements, an automated chat bot that can provide the basic needs of students, and so on. These necessities include FAQs, important manuals for processes such as enlistment and shifting, DLSU contacts, flowcharts, reviewers, notes, and more."},{"title":"Get Ready, Get Set, Go Out","desc":"This project aims to help prepare our batch for the transition to face-to-face classes, and will be done through pub mats that include safety reminders, nearby dorms for students living far away, ways to travel, and a DLSU Campus map. With thorough research, information, and consultation from the USG, this series will help allow for a worry-free transition from online to face-to-face classes."},{"title":"ElecSCIon","desc":"The overall umbrella project aims to show students the significance and roles of science in the upcoming National Elections. This will include the takes and platforms of the upcoming candidates regarding prevalent science-related issues, including the environment and climate change, the status of our country's public health, vaccines, and science education. This will be done through webinars and publicity materials from credible sources. This will also include other discussions and events that will help students in choosing the right candidates for the upcoming National Elections, and as well as other National Affairs concerns."},{"title":"The WORKing Formula","desc":"The realities and opportunities of a science student. A set of professionals from the science field will be invited to share their experiences working in our current set-up. This would allow the students to acquire knowledge about their preferred career paths and as well as widen their knowledge on their options. Other than career opportunities, there will also be internship opportunities for the students to utilize their knowledge in an actual workplace for them to hone their experiences and skills."},{"title":"Sci-Care Hub","desc":"A virtual hub using platforms such as Notion and Discord, wherein students can interact with different tools and strategies that will allow them to breathe in the middle of stress and adversities. This will promote the holistic well-being of the students, and as well as their mental health, especially with the current set-up and challenges that we face."},{"title":"ProdAKSYON","desc":"A series of discussions focused on productivity and project management through webinars, publicity materials, and workshops will be conducted. The pub series will contain different tips and tricks on being productive amidst the pandemic. And lastly, for the workshop, students will be able to practice and enhance their skills on productivity and project management through this activity."},{"title":"A Good COS","desc":"A Fundraising Activity through selling FOCUS2021 merchandise such as t-shirts, stickers, tote bags, etc. The money raised from the merch-selling will be used as funds for students who need internet assistance (data, load, etc) for their online classes. The criteria in giving internet assistance includes financial status or family income, allowance, region, and strength of internet connection in the place of the student."},{"title":"COS U-Night","desc":"A two-day online camping night full of exciting activities such as virtual bonfire sessions, movie nights, and games with raffles and prizes that will serve as a year-end event for the batch. This allows us to come together as one batch, and to connect and form bonds with one another."},{"title":"TOTEful Bags","desc":"A designing-contest with the theme being promoting the nature of our country, and at the same time advocating for environmental sustainability and the use of eco-friendly items through slogans. An advocacy that we, as science students, have in common. The most captivating designs will be used for the FOCUS2021 merchandise."}]},"__N_SSG":true}