{"pageProps":{"vision":{"line":"Advancing through Collaboration towards a Steadfast 76th ENG","desc":"As we advance towards our aspirations in the online setting, there will continue to be adversities in connecting with our fellow peers, accessing the necessary resources for academic progression, and enhancing our skill in managing our own workloads. It has also been a challenging shift for us, the students, to adjust with the DLSU life. Thus, we shall serve as the driving force to the unification of the students and administration through collaborative platforms.  This brings forth a 76th ENG that will be unwavering in their resolve and passions within and outside of DLSU."},"candidates":{"bp":{"fName":"Yani","lName":"Buhain","position":"Batch President","img":"https://via.placeholder.com/400x600","creds":["Executive for Program Watch, DLSU USG Office of the Vice President for Internal Affairs (2021)","Executive for Publicity and Promotions, DLSU Engineering College Government (2021) ","Documentations Head and Founding Member, Landas PH (2019) ","Community Involvement Committee Head, Assumption College Makati EXECOM (2020) ","Chief Marketing Officer, Landas PH (2021)"]},"vp":{"fName":"Frankie","lName":"Gamboa","position":"Batch Vice President","img":"https://via.placeholder.com/400x600","creds":["Executive for Documentations, DLSU USG Office of the Vice President for Internal Affairs (2021)","Leadership Awardee, CDC Supreme Student Government (2021)","Vice President, CDC Supreme Student Government (2019)","Rank 1 in STEM, Centro De Cultura INC. (2021)","Honorable Distinction in Writing, The Explorer School Publication (2021)"]},"bl":{"fName":"Alijaeh","lName":"Go","position":"Batch Legislator","img":"https://via.placeholder.com/400x600","creds":["Executivee for Internal Relations, DLSU Engineering College Government (2021)","President, WIN Student Government (2019)","Best Delegate of World Trade Center, Harvard Model Congress (2015)","Batch Salutatorian, The Winchester School Jebel Ali (2019)","National Olympiad for Biology, Chemistry, and Physics, International Olympiad Foundation (2018)"]}},"college":"gcoe","spoa":[{"title":"ENGL76HTEN","desc":"Due to the limitations on students to identify as true Lasallians, we offer ENGL7GHTEN as a two-phase holistic development project that focuses on enlightening the social and personal concerns of a Lasallian engineering student such as life in the GCOE through utilization of various media publicatons. This will therefore encourage an empathetic and approachable environment where every voice is represented."},{"title":"ENGTERACT: 76th ENG CULMINATING MONTH","desc":"ENGTERACT is a month-long project that aims to provide opportunities to create bigger networks and stronger connections within the batch.  Through a series of engaging activities we aim to cultivate their skills and talents. Our goal with this project is to establish an avenue that will allow students to form support systems with one another."},{"title":"76th ENG Support","desc":"Lack of accessible information and communication platforms for student concerns is evident with the online setting. 76th ENG Support is a collective platform that aims to disseminate information, gather student services concerns, and provide a wellness check-up concerning the overall academics status, health status and other issues of the students of 76th ENG."},{"title":"ENGhance","desc":"Students often find it hard to adjust their study habits while transitioning to their university life. ENGhance aims to provide learning skills and techniques that the batch can utilize to improve their study habits and overall work ethic. Making the students thoroughly equipped for the academic pacing of their engineering courses. ENGhance also aims to give students useful applications that they may use to enhance their overall academic performance."}]},"__N_SSG":true}