{"pageProps":{"vision":{"line":"Maximizing Opportunities With and For an Empowered, Progressive, and Student-centered EXCEL2024","desc":"Beginning our journey into our freshman year, we are offered various avenues to discover and realize what we are capable of as Lasallian achievers. As your first batch government, we want to join you in maximizing our experience through personalized and pro-student initiatives that cater to your needs. By providing you with opportunities to showcase your potential, we strive to highlight our empowered batch to further pursue passions and interests. In response to the call of the times, we aim to advance progressive student involvement and proactive social action towards becoming responsible citizens of the nation. All of this comes down to putting you in the center of our plans, as we seek to provide you with optimized student services that effectively address your concerns, suggestions and inquiries for a genuine student representation. As one, we can build an EXCEL 2024 that stands with and for you."},"candidates":{"bp":{"fName":"Kyla","lName":"Cansana","position":"Batch President","img":"https://via.placeholder.com/400x600","creds":["President, DLSZ High School Student Representative Coordinating Council (2020-2021)","St. La Salle, St. Benilde, St. Mutien Marie, and St. Miguel Lasallian Distinction Awardee (2020-2021)","Alfonso Yuchengco Foundation National Discipline Awardee (2020-2021)","DLSZ High School Student Representative Coordinating Council Leadership Awardee (2020-2021)","ABM Strand Top 1 Awardee, De La Salle Santiago Zobel (2020-2021)","Executive for Student Sector Relations, DLSU USG Office of the President","Executive for Academics and Development, DLSU School of Economics Government","Assistant Vice President for Organizational Development, Lasallian Scholars Society (Archer Achiever Scholar, DLSU)"]},"vp":{"fName":"CJ","lName":"Domacena","position":"Batch Vice President","img":"https://via.placeholder.com/400x600","creds":["Scriptwriter, The Augusteener","Liturgy Chairperson, Student Council of St. Augustine's School of Iba (2017-2018)","HS Representative, Student Council of St. Augustine's School of Iba (2018-2019)","News writer, The Augusteener","News reporter, The Augusteener","Volunteer, H3 Movement","Owner, Cakes & Crusts","Owner, Christianacraftsph"]},"bl":{"fName":"Mikee","lName":"Gadiana","position":"Batch Legislator","img":"https://via.placeholder.com/400x600","creds":["Best in Accountancy, Business, and Management, DLSU-IS Manila","Gold - General Excellence Award, DLSU-IS Manila","Gold - Achievement in Co-corricular Competitions, DLSU-IS Manila","Gold, Outstanding Organization Member, DLSU-IS Manila","Executive Auditor, DLSU-IS Manila Student Council (2020-2021)","Broadcasting Head, The Animo Publication (2020-2021)","Vice President for Finance, The Playhouse Project (2021)","Vice President, DLSU-IS Manila Student Council (2019-2020)","Head, DLSU SHS Student Committee (2019-2020)","Head, DLSU Senior's Ball Prom Committee (2019-2020)","Executive for Activities and Advocacies, DLSU SEG","Programs and Initiatives Executive, Office of the Chief Legislator"]}},"college":"soe","spoa":[{"title":"Boto, Kabataan!","desc":"Boto Kabataan is an information campaign on the upcoming National Elections 2022, especially intended for first-time voters in the freshman batch. In partnership with Boto Lasalyano, Sulong Pilipino, it features the know-how of the voting process, significance of the youth in elections, and economic programs initiated by the presidential candidates. This aims to raise awareness for students to exercise their national responsibilities and contribute to assessing leaders towards the development of the nation. "},{"title":"#WeekSOEry: EXCEL 2024","desc":"#WeekSOEry: EXCEL 2024 is a celebration of both the diversity and unity of the batch in various aspects from student life to personal interests. Through a series of team-building activities and showcases, we aim to encourage active involvement, form new friendships, and highlight the strengths that our batch has to offer."},{"title":"Navigation SOEpport","desc":"Navigation SOEpport is a unified online hub through carrd.co to serve as a centralized guide and platform for EXCEL 2024 to proactively address their frequently asked questions and student concerns. Included here are the directories for important contact details, a Google Calendar subscription of dates to remember, current and upcoming projects, and a simplified student services chatbot to answer inquiries faster."},{"title":"EconKnows","desc":"As future economists, EconKnows informs students of key economic programs and initiatives implemented in our nation. In the form of a newsletter, this is composed of recently implemented policies, their implications to the different sectors of the country, and policy briefs to address current concerns. Through this, we will be more informed of current affairs and adapt an economic perspective on pressing national affairs. "},{"title":"How to: EXCEL","desc":"How to: EXCEL is an accessible publication series to give EXCEL 2024 a meaningful introduction to SOE about the subjects, common requirements and professors, in order to help students prepare what they need for their terms in advance. This aims to guide students to adjust and adapt to the culture of professors and upperclassmen themselves. General subjects and double-degree majors can also be featured, depending on what the students need to focus more on for better understanding based on data from a simple constituency check. "},{"title":"#WelcomeHomeSOE","desc":"Aiming for a safe, gradual resumption of face-to-face classes, #WelcomeHomeSOE is an accessible consolidated manual of the life of an SOE student on campus. It comprises the important offices, buildings, and the respective contact details to take note of until the personal sentiments and favorite spots of the SOE students along the area to engage the freshman for the university experience. More importantly, this will serve as an initiative to coordinate with the Office of the President and the School of Economics Department to assess the conditions of EXCEL 2024 and determine the readiness to return to campus as soon as possible while observing strict health protocols and systems. "},{"title":"SOEcial Awareness Month","desc":"SOEcial Awareness Month provides a platform for students to be more socially aware and connect with personal advocacies. Through an information campaign and a roundtable discussion with representatives of advocacies such as youth empowerment, press freedom, gender equality, and the like, we will be able to educate ourselves and support these advocacies. As an end goal, we aim to raise funds for social beneficiaries and feature NGOs related to the advocacies that the students can join. "},{"title":"SOEe For Yourself","desc":"SOEe For Yourself aims to provide EXCEL 2024 with an outlook for possible career paths through talks with alumni from the 4 major courses (e.g. ECM, AEI, AEF, AEL) in SOE, as well as those with double degree majors. Speakers in different fields of expertise, such as in economics, accountancy, business administration, finance, sales, and the like, will be invited to share their experiences, and how their degrees have honed them into the job opportunities provided to them. "},{"title":"EXCEListens","desc":"To prioritize the welfare of EXCEL 2024, EXCEListens is a regular student-to-student means of communication held monthly to check up on all the students of the batch and directly gain insights in terms of improving student processes. It serves as a personalized system from the batch and for the batch to regularly evaluate and proactively respond to each other’s needs. "}]},"__N_SSG":true}