{"pageProps":{"vision":{"line":"Empowering Business Leaders Towards a Unified BLAZE2024","desc":"As we start our journey in becoming future-ready Lasallian business leaders, who are full of potential and passion, we come together to build the enthusiasm, motivation, and unity that our batch deserves. We want to empower each one of us by collaborating efforts towards a genuinely represented student-centered governance, providing opportunities that bring us together, and creating an impact in our society. All these will aid us in achieving our goal of being one BLAZE2024 as we progress with you in becoming business leaders of tomorrow."},"candidates":{"bp":{"fName":"Josene","lName":"Gonzales","position":"Batch President","img":"https://via.placeholder.com/400x600","creds":["Student Services Executive, Office of the Vice President for Internal Affairs","Student Services Associate, Business College Government","Volunteer, Talang Dalisay Organization","Social Media Engagement Officer, The Initiative PH","Club Head and Officer-in-Charge, Assumption College SCBA"]},"vp":{"fName":"Naith","lName":"Acosta","position":"Batch Vice President","img":"https://via.placeholder.com/400x600","creds":["Project Management Associate, Business College Government","Leadership Awardee, St. Pedro Poveda College","Productions and Logistics Committee Head, Student Council of Poveda","Organization President, Senior Plus Poveda Red Cross Youth","Grade 11 Batch Representative, Student Council of Poveda"]},"bl":{"fName":"Raphael","lName":"Hari-ong","position":"Batch Legislator","img":"https://via.placeholder.com/400x600","creds":["Archer Achiever Scholar","Co-Founder, Ahon Youth PH","President, Reedley International School Outreach Club","Headmaster's Medal Awardee, Reedley International School","Deportment Excellence Awardee, Reedley International School"]}},"college":"rvrcob","spoa":[{"title":"BLAZE MASTERCLASS","desc":"The BLAZE Masterclass is an avenue for us to better understand and develop the skills necessary for a COB student. From weekly workshops about resume building, handling legal business processes, and even building start-ups. This project will prepare us, BLAZE2024, to be the Lasallian business leaders of tomorrow."},{"title":"COBoto Na!","desc":"COBoto na! is a video series blast for the HALALAN2022 elections that aims to educate BLAZE2024 on the importance of voters education as newly registered voters. The video series will focus on introducing the presidential, vice presidential, and senatorial candidates and their previous impacts on the business sectors."},{"title":"COBasics: A Survival Guide Series","desc":"The BLAZE2024 Survival Guide is a year-long initiative centered on maximizing one's student life by offering various student services. This would provide different internal and external aid for us in the university. This includes projects such as Platform tutorials, newsletters, Announcement hubs, and more."},{"title":"BLAZE Unplugged","desc":"BLAZE Unplugged is a series of interactive projects such as game nights, block tournaments, and other similar activities. This project focuses on providing students a chance to take a break from academics and be an avenue where they can freely showcase their skills, talents, while at the same time promoting camaraderie and unity."},{"title":"Hawak Kamay","desc":"Hawak Kamay is a fundraising project that aims to provide the needs of our partner Lasallian Community. This creates a bridge for BLAZE2024 to work hand-in-hand and show our collaborative efforts while exemplifying our Lasallian Core Values."},{"title":"Dear BLAZE2024","desc":"DEAR BLAZE2024, is a video series for the batch from various COB alumni that aims to show an in depth understanding of their individual courses to show their life may be after college and what is in store for them. It serves as a personal avenue to hear and understand the journey and life of a Lasallian Business Leader outside the university."}]},"__N_SSG":true}