{"pageProps":{"vision":{"line":"Developing a Collaborative and Progressive CATCH 2T25","desc":"As we anticipate and work towards becoming empowered innovators, our goal is to foster a progressive CATCH2T25 through projects centered on strengthening connections, increasing social awareness, and providing opportunities for personal growth. Our focus will not only be on growing as individuals but also on our growth together as a batch through opportunities both inside and outside DLSU. We seek to discover our own strengths and weaknesses as one, pioneering, and forward-thinking CATCH2T25."},"candidates":{"bp":{"fName":"Aliex","lName":"Po","position":"Batch President","img":"https://via.placeholder.com/400x600","creds":["BS CS-CSE Course Representative 2021-2022","USG University Relations Executive 2021-2022","CSG Student Services Executive 2021-2022","Batch Treasurer 2018-2019","Grade 12 Stem Representative 2020-2021"]},"vp":{"fName":"Bianca","lName":"Cuales","position":"Batch Vice President","img":"https://via.placeholder.com/400x600","creds":["DLSU Computer Studies Government Course Representative for ID121 Term 1 BSCS-ST 2021-2022","DLSU Computer Studies Government Project Head for LP 2022: Pipol Power 2021-2022","DLSU Computer Studies Government Executive for Project Management 2021-2022","DLSU Startup Creator and Accelerator for Lasallian Entrepreneurs (SCALE) Member"]},"bl":{"fName":"Sebastian","lName":"Diaz","position":"Batch Legislator","img":"https://via.placeholder.com/400x600","creds":["Chief Communications Officer/Marketing Lead, GDSC DLSU 2021-2022","Executive for National & Civic Affairs, USG OPRES 2021-2022","Executive for Program Watch, USG OVPIA 2021-2022","Executive for Internal Relations, DLSU CSG 2021-2022","Editorial Writer, The Animo 2019-2021"]}},"college":"ccs","spoa":[{"title":"ICAO","desc":"ICAO is a program that focuses on career, opportunities, and networking. The issue that we aim to address through this project would be the concern regarding the availability of opportunities both during and after college. This program consists of networking nights, webinars on possible career paths, as well as an Opportunity Fair. By having these, we are able to assist our batchmates in finding their place in CCS, open doors for more opportunities, and learn more about the different fields relating to our programs."},{"title":"CATCH UP 2T25","desc":"CATCH UP: 2T25 is a 2-week program that focuses on connection building through games, zooms, and award nights. The first part of the program would consist of a google form which shall pair students with students who have the same interests as them. To add to these, a game night and social night will be held on the first Friday and second Friday of the month where CCS-related awards will be given out to the students. Moreover, this social night can serve as an avenue where students may exchange social media accounts and make new friends."},{"title":"BANTAY BAYAN 2022","desc":"BANTAY BAYAN 2022 is a week-long politics awareness campaign centered to cater “First Time Voters” and the technological side of the upcoming May 2022 Elections. This project will be a week-long informative series and will cover the electronic ballot system, ways to detect fake news, and the role of technology in influencing voters, most especially first-time voters. This project aims to enlighten and empower our students to strive to be responsible voters by tackling informative technology-related election controversies through publication materials."},{"title":"DATA 121","desc":"DATA 121 is an academic and career-focused information campaign to be integrated into the ONECCS website, meant to enhance our CCS journey. The idea is to equip CATCH2T25 with the tools and information our seniors wish they knew back when they were freshmen, inform ourselves regarding the different opportunities that lie ahead of us in CCS-related fields, and update ourselves with regards to the newest innovations in the technology industry"}]},"__N_SSG":true}