{"pageProps":{"vision":{"line":"Maximizing Opportunities With and For an Empowered, Progressive, and Student-centered EXCEL2024","desc":"Beginning our journey into our freshman year, we are offered various avenues to discover and realize what we are capable of as Lasallian achievers. As your first batch government, we want to join you in maximizing our experience through personalized and pro-student initiatives that cater to your needs. By providing you with opportunities to showcase your potential, we strive to highlight our empowered batch to further pursue passions and interests. In response to the call of the times, we aim to advance progressive student involvement and proactive social action towards becoming responsible citizens of the nation. All of this comes down to putting you in the center of our plans, as we seek to provide you with optimized student services that effectively address your concerns, suggestions and inquiries for a genuine student representation. As one, we can build an EXCEL 2024 that stands with and for you."},"candidates":{"bp":{"fName":"Kyla","lName":"Cansana","position":"Batch President","img":"https://via.placeholder.com/400x600","creds":["President, DLSZ High School Student Representative Coordinating Council (2020-2021)","St. La Salle, St. Benilde, St. Mutien Marie, and St. Miguel Lasallian Distinction Awardee (2020-2021)","Alfonso Yuchengco Foundation National Discipline Awardee (2020-2021)","DLSZ High School Student Representative Coordinating Council Leadership Awardee (2020-2021)","ABM Strand Top 1 Awardee, De La Salle Santiago Zobel (2020-2021)","Executive for Student Sector Relations, DLSU USG Office of the President","Executive for Academics and Development, DLSU School of Economics Government","Assistant Vice President for Organizational Development, Lasallian Scholars Society (Archer Achiever Scholar, DLSU)"]},"vp":{"fName":"CJ","lName":"Domacena","position":"Batch Vice President","img":"https://via.placeholder.com/400x600","creds":["Scriptwriter, The Augusteener","Liturgy Chairperson, Student Council of St. Augustine's School of Iba (2017-2018)","HS Representative, Student Council of St. Augustine's School of Iba (2018-2019)","News writer, The Augusteener","News reporter, The Augusteener","Volunteer, H3 Movement","Owner, Cakes & Crusts","Owner, Christianacraftsph"]},"bl":{"fName":"Mikee","lName":"Gadiana","position":"Batch Legislator","img":"https://via.placeholder.com/400x600","creds":["Best in Accountancy, Business, and Management, DLSU-IS Manila","Gold - General Excellence Award, DLSU-IS Manila","Gold - Achievement in Co-corricular Competitions, DLSU-IS Manila","Gold, Outstanding Organization Member, DLSU-IS Manila","Executive Auditor, DLSU-IS Manila Student Council (2020-2021)","Broadcasting Head, The Animo Publication (2020-2021)","Vice President for Finance, The Playhouse Project (2021)","Vice President, DLSU-IS Manila Student Council (2019-2020)","Head, DLSU SHS Student Committee (2019-2020)","Head, DLSU Senior's Ball Prom Committee (2019-2020)","Executive for Activities and Advocacies, DLSU SEG","Programs and Initiatives Executive, Office of the Chief Legislator"]}},"college":"soe","spoa":[{"title":"Boto, Kabataan!","desc":"Boto Kabataan is an interactive information campaign on the upcoming National Elections 2022, especially intended for first-time voters. It features the know-how of the voting process, significance of the youth in elections, and highlights the economic programs initiated by the presidential candidates on how our economy can recover from the pandemic. This aims to raise awareness for students to exercise their national responsibilities and promote a progressive mindset."},{"title":"#WeekSOEry: EXCEL 2024","desc":"#WeekSOEry: EXCEL2024 is a batch-wide celebration comprised of a series of team-building activities and showcases tailored to our interests and passions. Capturing both the diversity and unity of the batch, this aims to form new, long-lasting friendships, promote active involvement, and highlight the strengths that our batch has to offer."},{"title":"Navigation SOEpport","desc":"Navigation SOEpport is a unified online hub to serve as a centralized guide and platform for EXCEL2024 to proactively address their frequently asked questions and student concerns. Included here are the directories for important contact details, a Google Calendar subscription of dates to remember for the batch, current and upcoming projects, as well as a simplified student services chatbot to answer inquiries faster."},{"title":"EconKnows","desc":"To aid us as future economists, EconKnows informs students of key economic policies implemented in our nation. In the form of a termly newsletter, this features recent economic programs, policy briefs to address current issues, and the student insights' on these matters. This strives to promote awareness and develop an economic perspective on pressing national affairs."},{"title":"How to: EXCEL","desc":"How to: EXCEL is an accessible publication series to give EXCEL2024 a meaningful introduction to SOE about economic subjects and common requirements, in order to help students prepare what they need for their terms in advance. This also aims to guide students to adjust and adapt to the academic culture through possible insights from upperclassmen as well."},{"title":"#WelcomeHomeSOE","desc":"Aiming for a safe, gradual resumption of face-to-face classes, #WelcomeHomeSOE aims to centralize the safety protocols, systems, and information to be strictly observed, as well as join in continuously assessing the conditions of EXCEL 2024 to determine the readiness of the batch to return to campus as soon and as safe as possible. This initiative will also feature an engaging student-life manual to give the batch a glimpse of the DLSU experience in a face-to-face setting."},{"title":"SOEcial Awareness Month","desc":"SOEcial Awareness Month provides a platform for students connect with personal advocacies through roundtable discussions with advocates from youth empowerment, press freedom, gender equality, to women empowerment. This seeks to promote a socially active mindset and encourage civic participation. As an end goal, we aim to raise funds for social beneficiaries and feature NGOs related to the advocacies that the students can join."},{"title":"SOEe For Yourself","desc":"SOEe For Yourself aims to provide EXCEL 2024 with an outlook for possible career paths through roundtable discussions with alumni from the 4 major courses (e.g. ECM, AEI, AEF and AEL) in SOE, as well as those with double degree majors. Speakers in different fields of expertise, such as economics, accountancy, business administration, finance, sales, and the like, will be invited to share their experiences, and how their degrees have honed them into the job opportunities provided to them."},{"title":"EXCEListens","desc":"To prioritize the welfare of EXCEL 2024, EXCEListens is a consistent student-to-student means of communication held monthly to check up on all the students of the batch and directly gain insights in terms of improving student processes. It serves as a personalized system from the batch and for the batch to regularly evaluate and proactively respond to each other’s needs."}]},"__N_SSG":true}